# pol - мужской - 1, женский 2, не указан - 3 тип int
# activity_level уровень активности от 1 до 5, тип int
# type_of_activity - список из пяти характеристик, каждая от 1 до 5, т.е. тип list of integers, например [1, 2, 3, 2, 1]
# individuality - командный - 1, индивидуальный - 0, тип int


# dict_of_sports = {
#            "Пример", "уровень активности", "Выносливость", "Координация", "Сила", "Растяжка, "Мышление", "Командный"}

list_of_men_sports = [
    ["Хоккей", 4, 3, 5, 4, 2, 3, 1], ["Алтимат", 3, 2, 4, 2, 1, 3, 1], ["Диск-гольф", 2, 1, 5, 2, 1, 2, 0], ["Фехтование", 4, 3, 5, 3, 2, 2, 0],
    ["Армрестлинг", 3, 1, 3, 5, 1, 1, 0], ["Академическая гребля", 4, 4, 3, 4, 2, 2, 1], ["Плавание", 3, 4, 4, 3, 2, 2, 0],
    ["Бадминтон", 4, 1, 4, 1, 2, 2, 0], ["Баскетбол", 4, 3, 5, 3, 1, 3, 1], ["Волейбол", 4, 3, 5, 2, 1, 3, 1],
    ["Аэробика", 2, 2, 4, 3, 4, 2, 0], ["Функциональный тренинг" , 4, 3, 3, 3, 3, 1, 0], ["Настольный теннис", 4, 1, 4, 1, 1, 3, 0],
    ["Тяжёлая атлетика", 4, 2, 3, 5, 1, 1, 0], ["Пляжный волейбол", 4, 3, 5, 2, 1, 2, 1], ["Керлинг", 3, 1, 5, 3, 2, 4, 1],
    ["Легкая атлетика", 4, 4, 2, 3, 2, 2, 0], ["Лыжные гонки", 5, 5, 4, 3, 2, 3, 0], ["Биатлон", 5, 5, 4, 3, 2, 4, 0],
    ["Полиатлон", 4, 5, 4, 4, 2, 3, 0], ["Cтрельба", 2, 1, 5, 1, 2, 3, 0], ["Парусный спорт", 4, 2, 5, 2, 1, 4, 1],
    ["Регби", 4, 3, 4, 4, 1, 2, 1], ["Теннис", 4, 3, 5, 3, 2, 3, 0], ["Футбол", 3, 3, 4, 3, 1, 3, 1], ["Мини-футбол", 3, 2, 4, 3, 1, 3, 1],
    ["Пляжный футбол", 3, 2, 4, 3, 1, 3, 1], ["Шахматы", 2, 0, 1, 0, 0, 5, 0], ["Воркаут", 4, 1, 3, 5, 2, 1],
   [ "Самостоятельные тренировки", 2, 1, 3, 3, 2, 1, 0]
]

list_of_women_sports = [
    ["Алтимат", 3, 2, 4, 2, 1, 3, 1], ["Диск-гольф", 2, 1, 5, 2, 1, 2, 0], ["Фехтование", 4, 3, 5, 3, 2, 2, 0],
    ["Академическая гребля", 4, 4, 3, 4, 2, 2, 1], ["Плавание", 3, 4, 4, 3, 2, 2, 0], ["Бадминтон", 4, 1, 4, 1, 2, 2, 0],
    ["Волейбол", 4, 3, 5, 2, 1, 3, 1], ["Аэробика", 2, 2, 4, 3, 4, 2, 0], ["Функциональный тренинг" , 4, 3, 3, 3, 3, 1, 0],
    ["Настольный теннис", 4, 1, 4, 1, 1, 3, 0], ["Ритмическая гимнастика", 4, 2, 4, 1, 5, 2, 0], ["Чирлидинг", 3, 2, 3, 1, 2, 1, 1],
    ["Тяжёлая атлетика", 4, 2, 3, 5, 1, 1, 0], ["Пляжный волейбол", 4, 3, 5, 2, 1, 2, 1], ["Керлинг", 3, 1, 5, 3, 2, 4, 1],
    ["Легкая атлетика", 4, 4, 2, 3, 2, 2, 0], ["Лыжные гонки", 5, 5, 4, 3, 2, 3, 0], ["Биатлон", 5, 5, 4, 3, 2, 4, 0],
    ["Полиатлон", 4, 5, 4, 4, 2, 3, 0], ["Cтрельба", 2, 1, 5, 1, 2, 3, 0], ["Парусный спорт", 4, 2, 5, 2, 1, 4, 1],
    ["Теннис", 4, 3, 5, 3, 2, 3, 0], ["Футбол", 3, 3, 4, 3, 1, 3, 1], ["Мини-футбол", 3, 2, 4, 3, 1, 3, 1],
    ["Пляжный футбол", 3, 2, 4, 3, 1, 3, 1], ["Шахматы", 2, 0, 1, 0, 0, 5, 0], ["Воркаут", 4, 1, 3, 5, 2, 1],
    ["Самостоятельные тренировки", 2, 1, 3, 3, 2, 1, 0]
]


def test_na_sport(pol, activity_level, type_of_activity, individuality):
    best_sport_dict = {}  # для вывода лучшего спорта
    coord_list = [activity_level]  # создаём лист координат, описывающих выбор пользователя
    for num in type_of_activity:
        coord_list.append(num)
    coord_list.append(individuality)
    if pol == 1:  # если пол мужской
        for sport in list_of_men_sports:
            cur_list = sport[1:]  # список координат спорта
            vector = [(cur_list[i - 1] - coord_list[i - 1]) for i in range(len(coord_list))]  # вектор из разностей
            cur_length = ((vector[0] * 0.5) ** 2 + (vector[1] * 0.4) ** 2 + (vector[2] * 0.4) ** 2 + (vector[3] * 0.4) ** 2 +
                          (vector[4] * 0.4) ** 2 + (vector[5] * 0.4) ** 2 + (vector[6] * 3) ** 2) ** 0.5
            best_sport_dict[sport[0]] = cur_length
    elif pol == 2:
        for sport in list_of_women_sports:
            cur_list = sport[1:]  # список координат спорта
            vector = [(cur_list[i - 1] - coord_list[i - 1]) for i in range(len(coord_list))]  # вектор из разностей
            cur_length = ((vector[0] * 0.5) ** 2 + (vector[1] * 0.4) ** 2 + (vector[2] * 0.4) ** 2 + (vector[3] * 0.4) ** 2 +
                          (vector[4] * 0.4) ** 2 + (vector[5] * 0.4) ** 2 + (vector[6] * 3) ** 2) ** 0.5
            best_sport_dict[sport[0]] = cur_length
    else:
        for sport in list_of_men_sports:
            cur_list = sport[1:]  # список координат спорта
            vector = [(cur_list[i - 1] - coord_list[i - 1]) for i in range(len(coord_list))]  # вектор из разностей
            cur_length = ((vector[0] * 0.5) ** 2 + (vector[1] * 0.4) ** 2 + (vector[2] * 0.4) ** 2 + (vector[3] * 0.4) ** 2 +
                          (vector[4] * 0.4) ** 2 + (vector[5] * 0.4) ** 2 + (vector[6] * 3) ** 2) ** 0.5
            best_sport_dict[sport[0]] = cur_length
        for word in ["Чирлидинг", "Ритмическая гимнастика"]:
            cur_list = sport[1:]  # список координат спорта
            vector = [(cur_list[i - 1] - coord_list[i - 1]) for i in range(len(coord_list))]  # вектор из разностей
            cur_length = ((vector[0] * 0.5) ** 2 + (vector[1] * 0.4) ** 2 + (vector[2] * 0.4) ** 2 + (vector[3] * 0.4) ** 2 +
                          (vector[4] * 0.4) ** 2 + (vector[5] * 0.4) ** 2 + (vector[6] * 3) ** 2) ** 0.5
            best_sport_dict[word] = cur_length
    sorted_sport_list = sorted(best_sport_dict.items(), key=lambda y: y[1])
    return sorted_sport_list[0][0], sorted_sport_list[1][0], sorted_sport_list[2][0]


# test_1 = test_na_sport(1, 3, [5, 4, 3, 4, 5], 1)
# print(test_1)